# Input capabilities

In [2]:
import pandas as pd

df = pd.read_csv('data/artwork.csv', 
                 nrows = 50, 
                 index_col='id',
                 usecols=['id', 'artist', 'title', 'medium', 'year', 'height', 'width'])
df.head()

,artist,title,medium,year,width,height
id,,,,,,
1035,"Blake, Robert",A Figure Bowing before a Seated Old Man with h...,"Watercolour, ink, chalk and graphite on paper....",NaN,394.0,419.0
1036,"Blake, Robert","Two Drawings of Frightened Figures, Probably f...",Graphite on paper,NaN,311.0,213.0
1037,"Blake, Robert",The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785.0,343.0,467.0
1038,"Blake, Robert",Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,318.0,394.0
1039,"Blake, William",The Circle of the Lustful: Francesca da Rimini...,Line engraving on paper,1826.0,243.0,335.0

In [3]:
# save for later
df.to_pickle('data/artwork.pickle')

# Indexing and filtering

In [4]:
df['artist']

id
1035       Blake, Robert
1036       Blake, Robert
1037       Blake, Robert
1038       Blake, Robert
1039      Blake, William
1040      Blake, William
1041      Blake, William
1042      Blake, William
1043      Blake, William
1044      Blake, William
1045      Blake, William
1046      Blake, William
1047      Blake, William
1048      Blake, William
1049      Blake, William
1050      Blake, William
1051      Blake, William
1052      Blake, William
1053      Blake, William
1054      Blake, William
1055      Blake, William
1056      Blake, William
1057      Blake, William
1058      Blake, William
1059      Blake, William
1060      Blake, William
1061      Blake, William
1062      Blake, William
1063      Blake, William
1064      Blake, William
1065      Blake, William
1066      Blake, William
1067      Blake, William
1068      Blake, William
1069      Blake, William
1070      Blake, William
1071      Blake, William
1072      Blake, William
1073      Blake, William
1074      Blake, William
1075      Blake, William
1076      Blake, William
1077      Blake, William
1078      Blake, William
1079      Blake, William
1080      Blake, William
1081      Blake, William
1082      Blake, William
1083      Blake, William
1183    Richmond, George
Name: artist, dtype: object

In [18]:
pd.unique(df['artist'])

array(['Blake, Robert'], dtype=object)

In [21]:
s = df['artist'] == 'Blake, William'
s.value_counts()

True     45
False     5
Name: artist, dtype: int64

In [25]:
# selecting by position
df.loc[1035, 'artist'] # 1035 - id column!

'Blake, Robert'

In [26]:
df.iloc[0, 0]

'Blake, Robert'

In [27]:
df.iloc[0, :]

artist                                        Blake, Robert
title     A Figure Bowing before a Seated Old Man with h...
medium    Watercolour, ink, chalk and graphite on paper....
year                                                    NaN
Name: 1035, dtype: object

In [28]:
df.iloc[0:2, 0:2]

             artist                                              title
id
1035  Blake, Robert  A Figure Bowing before a Seated Old Man with h...
1036  Blake, Robert  Two Drawings of Frightened Figures, Probably f...

In [5]:
# manipulation
(df['height'] * df['width']).head(10)

id
1035    165086.0
1036     66243.0
1037    160181.0
1038    125292.0
1039     81405.0
1040     81120.0
1041     80828.0
1042     83640.0
1043     80735.0
1044     82620.0
dtype: float64

In [33]:
df['width'].sort_values().head()

id
1068     92.0
1070    112.0
1069    112.0
1071    115.0
1073    120.0
Name: width, dtype: float64

In [35]:
# convert
pd.to_numeric(df['width']).head(3)

id
1035    394.0
1036    311.0
1037    343.0
Name: width, dtype: float64

# Operations on groups

In [38]:
grouped = df.groupby('artist')
for name, group_df in grouped:
    print(name)
    print(group_df)
    break

Blake, Robert
             artist                                              title  \
id
1035  Blake, Robert  A Figure Bowing before a Seated Old Man with h...
1036  Blake, Robert  Two Drawings of Frightened Figures, Probably f...
1037  Blake, Robert  The Preaching of Warning. Verso: An Old Man En...
1038  Blake, Robert     Six Drawings of Figures with Outstretched Arms

                                                 medium    year  width  height
id
1035  Watercolour, ink, chalk and graphite on paper....     NaN  394.0   419.0
1036                                  Graphite on paper     NaN  311.0   213.0
1037        Graphite on paper. Verso: graphite on paper  1785.0  343.0   467.0
1038                                  Graphite on paper     NaN  318.0   394.0

# Joining multiple data tables

In [29]:
import pandas as pd

master = pd.read_pickle('data/master.pickle')
master.head()

,coachID,hofID,firstName,lastName,nameNote,nameGiven,nameNick,height,weight,shootCatch,...,birthDay,birthCountry,birthState,birthCity,deathYear,deathMon,deathDay,deathCountry,deathState,deathCity
playerID,,,,,,,,,,,,,,,,,,,,,
aaltoan01,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,L,...,4.0,Finland,NaN,Lappeenranta,NaN,NaN,NaN,NaN,NaN,NaN
abbeybr01,NaN,NaN,Bruce,Abbey,NaN,Bruce,NaN,73.0,185.0,L,...,18.0,Canada,ON,Toronto,NaN,NaN,NaN,NaN,NaN,NaN
abbotge01,NaN,NaN,George,Abbott,NaN,George Henry,Preacher,67.0,153.0,L,...,3.0,Canada,ON,Synenham,NaN,NaN,NaN,NaN,NaN,NaN
abbotre01,NaN,NaN,Reg,Abbott,NaN,Reginald Stewart,NaN,71.0,164.0,L,...,4.0,Canada,MB,Winnipeg,NaN,NaN,NaN,NaN,NaN,NaN
abdelju01,NaN,NaN,Justin,Abdelkader,NaN,NaN,NaN,73.0,195.0,L,...,25.0,USA,MI,Muskegon,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
scoring = pd.read_pickle('data/scoring.pickle')
scoring.head()

,playerID,year,stint,tmID,lgID,pos,GP,G,A,Pts,...,PostA,PostPts,PostPIM,Post+/-,PostPPG,PostPPA,PostSHG,PostSHA,PostGWG,PostSOG
0,aaltoan01,1997,1,ANA,NHL,C,3,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,aaltoan01,1998,1,ANA,NHL,C,73,3,5,8,...,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,aaltoan01,1999,1,ANA,NHL,C,63,7,11,18,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,aaltoan01,2000,1,ANA,NHL,C,12,1,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,abbeybr01,1975,1,CIN,WHA,D,17,1,0,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [31]:
pd.merge(master, scoring, left_index=True, right_on="playerID").head(5)

,coachID,hofID,firstName,lastName,nameNote,nameGiven,nameNick,height,weight,shootCatch,...,PostA,PostPts,PostPIM,Post+/-,PostPPG,PostPPA,PostSHG,PostSHA,PostGWG,PostSOG
0,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,L,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,L,...,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,L,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,L,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,Bruce,Abbey,NaN,Bruce,NaN,73.0,185.0,L,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN